; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v6 ?v4)
             (pred_8 ?v10 ?v3)
             (pred_10 ?v6 ?v3)
             (pred_1 ?v2 ?v6 )
	     (pred_6 ?v6)
             (pred_2 ?v8)
             (pred_5 ?v10)
             (pred_3 ?v3)
             (pred_12 ?v6)
             (pred_7 ?v10)
             (pred_4 ?v6)
             (pred_11 ))



(:action op_4
:parameters (?v13 ?v12 ?v1 ?v9)
:precondition (and (pred_2 ?v13) (pred_2 ?v12) (pred_5 ?v1) (pred_3 ?v9)
          (pred_9 ?v13 ?v12) (pred_8 ?v1 ?v9)
                   (pred_10 ?v12 ?v9) (pred_6 ?v13) 
                   (pred_12 ?v12) (pred_7 ?v1))
:effect (and  (pred_4 ?v12) (not (pred_12 ?v12))))


(:action op_2
:parameters (?v13 ?v11)
:precondition (and (pred_2 ?v13) (pred_2 ?v11)
               (pred_6 ?v13) (pred_9 ?v13 ?v11) (pred_4 ?v11))
:effect (and (pred_6 ?v11) (not (pred_6 ?v13))))

(:action op_1
:parameters (?v13 ?v1)
:precondition (and (pred_2 ?v13) (pred_5 ?v1) 
                  (pred_6 ?v13) (pred_1 ?v1 ?v13) (pred_11 ))
:effect (and (pred_7 ?v1)
   (not (pred_1 ?v1 ?v13)) (not (pred_11 ))))


(:action op_3
:parameters (?v13 ?v5 ?v7)
:precondition (and (pred_2 ?v13) (pred_5 ?v5) (pred_5 ?v7)
                  (pred_6 ?v13) (pred_7 ?v7) (pred_1 ?v5 ?v13))
:effect (and (pred_7 ?v5) (pred_1 ?v7 ?v13)
        (not (pred_7 ?v7)) (not (pred_1 ?v5 ?v13))))

(:action op_5
:parameters (?v13 ?v1)
:precondition (and (pred_2 ?v13) (pred_5 ?v1) 
                  (pred_6 ?v13) (pred_7 ?v1))
:effect (and (pred_11 ) (pred_1 ?v1 ?v13) (not (pred_7 ?v1)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_17 obj_18 obj_05 obj_03 obj_11 obj_01 obj_14 obj_15 obj_16 obj_12 obj_04 obj_13 obj_06 obj_07 obj_08 obj_20
    obj_09 obj_02
    obj_19 obj_10
    )

    (:init
       (pred_11)

       (pred_2 obj_17)
       (pred_2 obj_18)
       (pred_2 obj_05)
       (pred_2 obj_03)
       (pred_2 obj_11)
       (pred_2 obj_01)
       (pred_2 obj_14)
       (pred_2 obj_15)
       (pred_2 obj_16)
       (pred_2 obj_12)
       (pred_2 obj_04)
       (pred_2 obj_13)
       (pred_2 obj_06)
       (pred_2 obj_07)
       (pred_2 obj_08)
       (pred_2 obj_20)
       (pred_3 obj_09)
       (pred_3 obj_02)
       (pred_5 obj_19)
       (pred_5 obj_10)

       (pred_9 obj_17 obj_11)
       (pred_9 obj_17 obj_18)
       (pred_9 obj_18 obj_01)
       (pred_9 obj_18 obj_05)
       (pred_9 obj_18 obj_17)
       (pred_9 obj_05 obj_14)
       (pred_9 obj_05 obj_03)
       (pred_9 obj_05 obj_18)
       (pred_9 obj_03 obj_15)
       (pred_9 obj_03 obj_05)
       (pred_9 obj_11 obj_16)
       (pred_9 obj_11 obj_01)
       (pred_9 obj_11 obj_17)
       (pred_9 obj_01 obj_12)
       (pred_9 obj_01 obj_14)
       (pred_9 obj_01 obj_18)
       (pred_9 obj_01 obj_11)
       (pred_9 obj_14 obj_04)
       (pred_9 obj_14 obj_15)
       (pred_9 obj_14 obj_05)
       (pred_9 obj_14 obj_01)
       (pred_9 obj_15 obj_13)
       (pred_9 obj_15 obj_03)
       (pred_9 obj_15 obj_14)
       (pred_9 obj_16 obj_06)
       (pred_9 obj_16 obj_12)
       (pred_9 obj_16 obj_11)
       (pred_9 obj_12 obj_07)
       (pred_9 obj_12 obj_04)
       (pred_9 obj_12 obj_01)
       (pred_9 obj_12 obj_16)
       (pred_9 obj_04 obj_08)
       (pred_9 obj_04 obj_13)
       (pred_9 obj_04 obj_14)
       (pred_9 obj_04 obj_12)
       (pred_9 obj_13 obj_20)
       (pred_9 obj_13 obj_15)
       (pred_9 obj_13 obj_04)
       (pred_9 obj_06 obj_07)
       (pred_9 obj_06 obj_16)
       (pred_9 obj_07 obj_08)
       (pred_9 obj_07 obj_12)
       (pred_9 obj_07 obj_06)
       (pred_9 obj_08 obj_20)
       (pred_9 obj_08 obj_04)
       (pred_9 obj_08 obj_07)
       (pred_9 obj_20 obj_13)
       (pred_9 obj_20 obj_08)
       (pred_12 obj_16)
       (pred_12 obj_18)
       (pred_10  obj_16 obj_09)
       (pred_10  obj_18 obj_02)
       (pred_4 obj_17)
       (pred_4 obj_05)
       (pred_4 obj_03)
       (pred_4 obj_11)
       (pred_4 obj_01)
       (pred_4 obj_14)
       (pred_4 obj_15)
       (pred_4 obj_12)
       (pred_4 obj_04)
       (pred_4 obj_13)
       (pred_4 obj_06)
       (pred_4 obj_07)
       (pred_4 obj_08)
       (pred_4 obj_20)

       (pred_8  obj_19 obj_09)
       (pred_8  obj_10 obj_02)
       (pred_1 obj_19 obj_04)
       (pred_1 obj_10 obj_05)
       (pred_6 obj_12)
    )

    (:goal (and
       (pred_1 obj_19 obj_11)
    ))
(:constraints
  (always (not (pred_6 obj_14)))
)
)

; plan
1. (op_2 obj_12 obj_04)
   deleted: (pred_6 obj_12)
   added: (pred_6 obj_04)
   goals met: 0 of 1
2. (op_1 obj_04 obj_19)
   deleted: (pred_1 obj_19 obj_04) (pred_11)
   added: (pred_7 obj_19)
   goals met: 0 of 1
3. (op_2 obj_04 obj_12)
   deleted: (pred_6 obj_04)
   added: (pred_6 obj_12)
   goals met: 0 of 1
4. (op_2 obj_12 obj_01)
   deleted: (pred_6 obj_12)
   added: (pred_6 obj_01)
   goals met: 0 of 1
5. (op_2 obj_01 obj_11)
   deleted: (pred_6 obj_01)
   added: (pred_6 obj_11)
   goals met: 0 of 1
6. (op_5 obj_11 obj_19)
   deleted: (pred_7 obj_19)
   added: (pred_11) (pred_1 obj_19 obj_11)
   goals met: 1 of 1
